computer.org
#+TITLE: Computer
#+PROPERTY: header-args :mkdirp yes

- TODO maybe make instances of my name/email be shared. Noweb or would some other mechanism be better?
* Channels
#+begin_src scheme :tangle gen/.config/guix/channels.scm
(cons* (channel
        (name 'penitent-tangent)
        (url "file:///home/pharcosyle/Projects/penitent-tangent"))
       (channel
        (name 'flat)
        (url "https://github.com/flatwhatson/guix-channel.git")
        (introduction
         (make-channel-introduction
          "33f86a4b48205c0dc19d7c036c85393f0766f806"
          (openpgp-fingerprint
           "736A C00E 1254 378B A982  7AF6 9DBE 8265 81B6 4490"))))
       (channel
        (name 'rde)
        (url "https://git.sr.ht/~abcdw/rde")
        (introduction
         (make-channel-introduction
          "257cebd587b66e4d865b3537a9a88cccd7107c95"
          (openpgp-fingerprint
           "2841 9AC6 5038 7440 C7E9  2FFA 2208 D209 58C1 DEB0"))))
       (channel
        (name 'nonguix)
        (url "https://gitlab.com/nonguix/nonguix")
        (introduction
         (make-channel-introduction
          "897c1a470da759236cc11798f4e0a5f7d4d59fbc"
          (openpgp-fingerprint
           "2A39 3FFF 68F4 EF7A 3D29  12AF 6F51 20A0 22FB B2D5"))))
       %default-channels)

;; (append (channel
;;          (name 'penitent-tangent)
;;          (url "file:///home/pharcosyle/Projects/penitent-tangent"))
;;         (channel
;;          (name 'flat)
;;          (url "https://github.com/flatwhatson/guix-channel.git")
;;          (introduction
;;           (make-channel-introduction
;;            "33f86a4b48205c0dc19d7c036c85393f0766f806"
;;            (openpgp-fingerprint
;;             "736A C00E 1254 378B A982  7AF6 9DBE 8265 81B6 4490")))
;;          (commit "7b8353ebbcf486e3344924d1cac0fa7ba47c371d"))
;;         (channel
;;          (name 'rde)
;;          (url "https://git.sr.ht/~abcdw/rde")
;;          (introduction
;;           (make-channel-introduction
;;            "257cebd587b66e4d865b3537a9a88cccd7107c95"
;;            (openpgp-fingerprint
;;             "2841 9AC6 5038 7440 C7E9  2FFA 2208 D209 58C1 DEB0")))
;;          (commit "930b9aa377cd4b2fbf43e39b2583df27b70f8ad0"))
;;         (channel
;;          (name 'nonguix)
;;          (url "https://gitlab.com/nonguix/nonguix")
;;          (introduction
;;           (make-channel-introduction
;;            "897c1a470da759236cc11798f4e0a5f7d4d59fbc"
;;            (openpgp-fingerprint
;;             "2A39 3FFF 68F4 EF7A 3D29  12AF 6F51 20A0 22FB B2D5")))
;;          (commit "706d8af5b111d85902280f1154dc4fad683b5281"))
;;         (channel
;;          (name 'guix)
;;          (url "https://git.savannah.gnu.org/git/guix.git")
;;          (introduction
;;           (make-channel-introduction
;;            "9edb3f66fd807b096b48283debdcddccfea34bad"
;;            (openpgp-fingerprint
;;             "BBB0 2DDF 2CEA F6A8 0D1D  E643 A2A0 6DF2 A33A 54FA")))
;;          (commit "20dfda3d9ebb14b72ed33fed940ee3a1f030c99a")))
#+end_src
* System
** Frostfire
#+begin_src scheme :tangle gen/computer/system/frostfire.scm
(load "spartan.scm")
(define-module (computer system frostfire)
  #:use-module ((gnu system) #:select (operating-system %default-kernel-arguments %base-firmware %base-packages))
  #:use-module ((gnu system accounts) #:select (user-account))
  #:use-module ((gnu system file-systems) #:select (file-system uuid %base-file-systems))
  #:use-module ((gnu system keyboard) #:select (keyboard-layout))
  #:use-module ((gnu system shadow) #:select (%base-user-accounts))
  #:use-module ((gnu bootloader) #:select (bootloader-configuration))
  #:use-module ((gnu bootloader grub) #:select (grub-efi-bootloader))
  #:use-module ((gnu services) #:select (service simple-service modify-services))
  #:use-module ((gnu services base) #:select (guix-service-type guix-configuration udev-service-type %default-authorized-guix-keys))
  #:use-module ((gnu services desktop) #:select (gnome-desktop-service-type bluetooth-service %desktop-services))
  #:use-module ((gnu services xorg) #:select (xorg-configuration set-xorg-configuration %default-xorg-modules))
  #:use-module ((gnu packages) #:select (specification->package))
  #:use-module ((gnu packages linux) #:select (brightnessctl))
  #:use-module ((guix gexp) #:select (local-file))
  #:use-module ((guix store) #:select (%default-substitute-urls))
  #:use-module ((nongnu system linux-initrd) #:select (microcode-initrd))
  #:use-module ((nongnu packages linux) #:select (linux-firmware broadcom-bt-firmware broadcom-sta))
  #:use-module ((penitent-tangent packages xf86-input-mtrack) :select (xf86-input-mtrack))
  #:use-module ((computer system spartan) #:select (spartan))

  #:use-module ((nongnu packages linux) #:select (linux))
  ;; #:use-module ((srfi srfi-1) #:select (first))
  ;; #:use-module ((guix channels) #:select (channel))
  ;; #:use-module ((guix inferior) #:select (inferior-for-channels lookup-inferior-packages))
  )

(define %my-xorg-config
  "
Section \"InputClass\"
  Identifier      \"Keyboards\"
  Driver          \"libinput\"
  MatchIsKeyboard \"on\"
EndSection
Section \"InputClass\"
  Identifier      \"Touchpads\"
  Driver          \"mtrack\"
  MatchIsTouchpad \"on\"
EndSection
")

(operating-system
  (kernel linux)
  ;; (kernel
  ;;   (let*
  ;;     ((channels
  ;;       (list (channel
  ;;              (name 'nonguix)
  ;;              (url "https://gitlab.com/nonguix/nonguix")
  ;;              (commit "c5fed11e7df221cad1045fc193b4136b34e23451"))
  ;;             (channel
  ;;              (name 'guix)
  ;;              (url "https://git.savannah.gnu.org/git/guix.git")
  ;;              (commit "4343476a3bffeb3714ad50ff7559c4b7f7c81551"))))
  ;;      (inferior
  ;;       (inferior-for-channels channels)))
  ;;     (first (lookup-inferior-packages inferior "linux" "5.12.9"))))
  (kernel-arguments (let ((kargs %default-kernel-arguments)
                          (blacklist "b43,b43legacy,ssb,bcm43xx,brcm80211,brcmfmac,brcmsmac,bcma"))
                      (cons* (string-append (car kargs) "," blacklist) (cdr kargs))))
  (kernel-loadable-modules (list broadcom-sta))
  (initrd microcode-initrd)
  (firmware (cons* broadcom-bt-firmware
                   linux-firmware
                   %base-firmware))
  (locale "en_US.utf8")
  (timezone "America/Los_Angeles")
  (keyboard-layout (keyboard-layout "us" #:model "macbook78"))
  (host-name "frostfire")
  (users (cons* (user-account
                  (name "pharcosyle")
                  (comment "Krzysztof Baranowski")
                  (group "users")
                  (home-directory "/home/pharcosyle")
                  (supplementary-groups
                    '("wheel" "netdev" "audio" "video" "input"))) ; `input' group necessary for mtrack ; TODO (at present, maybe there's a way around this. Libinput doesn't need it, for example, but maybe it's "built in" or something. Also I'd ideally like the touchpad to work on the gdm login screen.)
                %base-user-accounts))
  (packages
    (append
      (list (specification->package "nss-certs")
            (specification->package "xf86-input-libinput")
            (specification->package "xf86-input-mtrack")
            spartan)
      %base-packages))
  (services
   (cons* (service gnome-desktop-service-type)
          (set-xorg-configuration
           (xorg-configuration
            (modules (cons* xf86-input-mtrack
                            %default-xorg-modules))
            (keyboard-layout keyboard-layout)
            (extra-config (list %my-xorg-config))))
          (simple-service 'my-brightnessctl-udev-rules udev-service-type (list brightnessctl))
          (bluetooth-service #:auto-enable? #t)
          (modify-services %desktop-services
                           (guix-service-type config =>
                                              (guix-configuration
                                               (inherit config)
                                               (substitute-urls
                                                (append %default-substitute-urls
                                                        (list "https://mirror.brielmaier.net")))
                                               (authorized-keys
                                                (append %default-authorized-guix-keys
                                                        (list (local-file "./mirror.brielmaier.net.pub")))))))
          ;; %desktop-services
          ))
  (bootloader
    (bootloader-configuration
      (bootloader grub-efi-bootloader)
      (target "/boot/efi")
      (keyboard-layout keyboard-layout)))
  (file-systems
    (cons* (file-system
             (mount-point "/")
             (device
               (uuid "8359c1c2-f3f8-4693-9cab-838862daae9b"
                     'ext4))
             (type "ext4"))
           (file-system
             (mount-point "/boot/efi")
             (device (uuid "67E3-17ED" 'fat32))
             (type "vfat"))
           %base-file-systems)))
#+end_src
** mirror.brielmaier.net.pub
#+begin_src scheme :tangle gen/computer/system/mirror.brielmaier.net.pub
(public-key
  (ecc
    (curve Ed25519)
    (q #7514F8D729DB1935470A581CE3851ED9FD6F1F9BAFE1D8BEC77A931ADB7A4337#)))
#+end_src
** Spartan
#+begin_src scheme :tangle gen/computer/system/spartan.scm
(define-module (computer system spartan)
  #:use-module ((guix packages) #:select (package))
  #:use-module ((guix build-system trivial) #:select (trivial-build-system)))

(define-public spartan
  (package
   (name "spartan")
   (version "0")
   (synopsis "Spartan Window Manager")
   (source #f)
   (build-system trivial-build-system)
   (arguments
    `(#:modules ((guix build utils))
      #:builder
      (begin
        (use-modules ((guix build utils) #:select (mkdir-p make-desktop-entry-file)))
        (let* ((out (assoc-ref %outputs "out"))
               (xsessions (string-append out "/share/xsessions")))
          (mkdir-p xsessions)
          (make-desktop-entry-file
           (string-append xsessions (string-append "/" ,name ".desktop"))
           #:name (string-capitalize ,name)
           #:comment ,synopsis
           #:exec "spartan"))
        #t)))
   (description synopsis)
   (home-page #f)
   (license #f)))
#+end_src
* Home Environment
** Solitude
#+begin_src scheme :tangle gen/computer/home/solitude.scm
(load "spartan-binary.scm")
(define-module (computer home solitude)
  #:use-module ((gnu home) #:select (home-environment))
  ;; #:use-module (gnu home-services)
  ;; #:use-module (gnu home-services gnupg)
  ;; #:use-module (gnu home-services ssh)
  #:use-module ((gnu home-services version-control) #:select (home-git-service-type home-git-configuration))
  #:use-module ((gnu home-services files) #:select (home-files-service-type))
  #:use-module ((gnu home-services) #:select (home-environment-variables-service-type))
  #:use-module ((gnu home-services shells) #:select (home-bash-service-type))
  #:use-module ((gnu home-services shellutils) #:select (home-bash-direnv-service-type))
  ;; #:use-module (gnu home-services mcron)
  #:use-module ((gnu services) #:select (service simple-service))
  #:use-module ((gnu packages) #:select (specification->package))
  ;; #:use-module (gnu packages linux)
  ;; #:use-module (gnu packages admin)
  ;; #:use-module (gnu packages gnupg)
  ;; #:use-module (gnu system keyboard)
  #:use-module ((guix packages) #:select (package-input-rewriting))
  #:use-module ((guix gexp) #:select (local-file))

  #:use-module ((gnu packages emacs) #:select (emacs))
  #:use-module ((flat packages emacs) #:select (emacs-native-comp))

  #:use-module ((computer home spartan-binary) #:select (spartan-binary)))

;; (define %my-fontconfig-config-file
;;   "
;; <?xml version=\"1.0\"?>
;; <!DOCTYPE fontconfig SYSTEM \"fonts.dtd\">
;; <fontconfig>
;;   <dir>~/org/spring_cleaning/.guix-extra-profiles/multiverse/multiverse/share/fonts</dir>
;;   <match target=\"font\">
;;     <test name=\"family\" compare=\"eq\">
;;         <string>Source Code Pro</string>
;;     </test>
;;     <edit mode=\"assign\" name=\"hintstyle\">
;;       <const>hintfull</const>
;;     </edit>
;;     <edit name=\"antialias\" mode=\"assign\">
;;       <bool>true</bool>
;;     </edit>
;;   </match>
;; </fontconfig>
;; ")

(home-environment
 ;; (packages (list htop))
 (packages (list spartan-binary
                 ;; ((package-input-rewriting `((,emacs . ,emacs-native-comp)))
                 ;;  spartan-binary)
                 ;; TODO temporary font packages to make guix-home fontconfig work
                 (specification->package "font-google-noto")
                 (specification->package "font-adobe-source-code-pro")))
 (services
  (list
   (simple-service 'my-channels
                   home-files-service-type
                   (list `("config/guix/channels.scm"
                           ,(local-file "../../.config/guix/channels.scm"))))
   ;; TODO Documentation gives this example for setting LESSHISTFILE but maybe doing it in a shell profile would be better?
   (simple-service 'my-env-vars
                   home-environment-variables-service-type
                   `(("LESSHISTFILE" . "$XDG_CACHE_HOME/.lesshst")
                     ;; ("SHELL" . ,(file-append zsh "/bin/zsh"))
                     ))
   (service home-bash-service-type
;;             (home-bash-configuration
;;              (bash-profile '("\
;; export HISTFILE=\"$XDG_CACHE_HOME\"/.bash_history")))
            )
   (service home-git-service-type
            (home-git-configuration
             (config
              `((user
                 ((name . "Krzysztof Baranowski")
                  (email . "pharcosyle@gmail.com")))
                ;; (http "https://weak.example.com"
                ;;   ((ssl-verify . #f)))
                ;; (gpg
                ;;  ((program . ,(file-append gnupg "/bin/gpg"))))
                ;; (sendmail
                ;;  ((annotate . #t)))
                ))))
   (simple-service 'my-doomdir
                   home-files-service-type
                   (list `("config/doom"
                           ,(local-file "../../.config/doom" #:recursive? #t))))
   (service home-bash-direnv-service-type)
   ;; (service home-keyboard-service-type
   ;;          (keyboard-layout "us,ru" "dvorak,"
   ;;                           #:options '("grp:win_space_toggle" "ctrl:nocaps")))
   ;; (service home-fontconfig-service-type)
   ;; (simple-service 'my-fontconfig-config-file
   ;;                 home-files-service-type
   ;;                 (list `("config/fontconfig/fonts.conf"
   ;;                         ,(plain-file "fonts.conf" %my-fontconfig-config-file))))
   ;; (service home-ssh-service-type
   ;;          (home-ssh-configuration
   ;;           (extra-config
   ;;            (list
   ;;             (ssh-host "savannah"
   ;;                       '((compression . #f)))))))
   ;; (service home-gnupg-service-type
   ;;          (home-gnupg-configuration
   ;;           (gpg-agent-config
   ;;            (home-gpg-agent-configuration
   ;;             (ssh-agent? #t)))))
   )))

;; (service home-state-service-type
;;          (append
;;           (list
;;            (state-rsync "/home/bob/tmp/example-rsync-state/"
;;                         "abcdw@olorin.lan:/var/services/homes/abcdw/tmp-state/")
;;            (state-git "/home/bob/tmp/talkes/"
;;                       "git@git.sr.ht:~abcdw/rde"))))
#+end_src
